def unicode_replace(string:str) -> str:
	_transdict = {
		"A":"𝐀𝐚ΑАᎪᗅᴀꓮꭺＡ𐊠ɑαа⍺ａ𝐚𝑎𝒂𝒶𝓪𝔞𝕒𝖆𝖺𝗮𝘢𝙖𝚊𝛂𝛼𝜶𝝰𝞪",
		"B":"𝐁𝐛ʙΒВвᏴᏼᗷᛒℬꓐꞴＢ𐊂𐊡𐌁𝐁𝐵𝑩𝓑𝔅𝔹𝕭𝖡𝗕𝘉𝘽𝙱𝚩𝛣𝜝𝝗𝞑ƄЬᏏᑲᖯｂ𝐛𝑏𝒃𝒷𝓫𝔟𝕓𝖇𝖻𝗯𝘣𝙗𝚋",
		"C":"𝐂𝐜ϹСᏟᑕℂℭⅭ⊂Ⲥ⸦ꓚＣ𐊢𐌂𐐕ϲсᴄⅽⲥꮯｃ𐐽𝐜𝑐𝒄𝒸𝓬𝔠𝕔𝖈𝖼𝗰𝘤𝙘𝚌",
		"D":"𝐃𝐝ᎠᗞᗪᴅⅅⅮꓓꭰＤ𝐃𝐷𝑫𝒟𝓓𝔇𝔻𝕯𝖣𝗗𝘋𝘿𝙳ԁᏧᑯⅆⅾꓒｄ𝐝𝑑𝒅𝒹𝓭𝔡𝕕𝖉𝖽𝗱𝘥𝙙𝚍",
		"E":"𝐄𝐞ΕЕᎬᴇℰ⋿ⴹꓰꭼＥ𐊆еҽ℮ℯⅇꬲｅ𝐞𝑒𝒆𝓮𝔢𝕖𝖊𝖾𝗲𝘦𝙚𝚎",
		"F":"𝐅𝐟ϜᖴℱꓝꞘＦ𐊇𐊥ſϝքẝꞙꬵｆ𝐟𝑓𝒇𝒻𝓯𝔣𝕗𝖋𝖿𝗳𝘧𝙛𝚏𝟋",
		"G":"𝐆ɢԌԍᏀᏳᏻꓖꮐＧ𝐆𝐺𝑮𝒢𝓖𝔊𝔾𝕲𝖦𝗚𝘎𝙂𝙶ƍɡցᶃℊｇ𝐠𝑔𝒈𝓰𝔤𝕘𝖌𝗀𝗴𝘨𝙜𝚐",
		"H":"𝐇ʜΗНнᎻᕼℋℌℍⲎꓧꮋＨ𐋏𝐇𝐻𝑯𝓗𝕳𝖧𝗛𝘏𝙃𝙷𝚮𝛨𝜢𝝜𝞖һհᏂℎｈ𝐡𝒉𝒽𝓱𝔥𝕙𝖍𝗁𝗵𝘩𝙝𝚑",
		"I":"𝐈ᎥɪΙІіӀℐℑℹⅈⅠⅰⲒꓲꭵＩｉ",
		"J":"𝐉ͿЈᎫᒍᴊꓙꞲꭻＪ𝐉𝐽𝑱𝒥𝓙𝔍𝕁𝕵𝖩𝗝𝘑𝙅𝙹ϳјⅉｊ𝐣𝑗𝒋𝒿𝓳𝔧𝕛𝖏𝗃𝗷𝘫𝙟𝚓",
		"K":"𝐊ΚКᏦᛕKⲔꓗＫｋ𝐤𝑘𝒌𝓀𝓴𝔨𝕜𝖐𝗄𝗸𝘬𝙠𝚔",
		"L":"𝐋ʟᏞᒪℒⅬⳐⳑꓡꮮＬ𐐛𐑃Ɩⅼﺎｌℓӏ",
		"M":"𝐌ΜϺМᎷᗰᛖℳⅯⲘꓟＭ𐊰𐌑𝐌𝑀𝑴𝓜𝔐𝕄𝕸𝖬𝗠𝘔𝙈𝙼𝚳𝛭𝜧𝝡𝞛ｍ",
		"N":"𝐍ɴΝℕⲚꓠＮոռｎ𝐧𝑛𝒏𝓃𝓷𝔫𝕟𝖓𝗇𝗻𝘯𝙣𝚗",
		"O":"𝐎ΟοσОоՕօ०০੦૦ଠ୦ഠ๐໐ဝ၀ჿዐᴏᴑℴⲞⲟⵔ〇ꓳꬽ０Ｏｏ𐊒𐊫𐐄𐐬𐓂𐓪",
		"P":"𝐏ΡРᏢᑭᴘᴩℙⲢꓑꮲＰ𐊕𝐏𝑃𝑷𝒫𝓟𝔓𝕻𝖯𝗣𝘗𝙋𝙿𝚸𝛲𝜬𝝦𝞠ρϱр⍴ⲣｐ𝐩𝑝𝒑𝓅𝓹𝔭𝕡𝖕𝗉𝗽𝘱𝙥𝚙𝛒𝛠𝜌𝜚𝝆𝝔𝞀𝞎𝞺𝟈",
		"Q":"𝐐ℚⵕＱ𝐐𝑄𝑸𝒬𝓠𝔔𝕼𝖰𝗤𝘘𝙌𝚀ԛգզｑ𝐪𝑞𝒒𝓆𝓺𝔮𝕢𝖖𝗊𝗾𝘲𝙦𝚚",
		"R":"𝐑ƦʀᎡᏒᖇᚱℛℜℝꓣꭱꮢＲ𐒴гᴦⲅꭇꭈꮁｒ𝐫𝑟𝒓𝓇𝓻𝔯𝕣𝖗𝗋𝗿𝘳𝙧𝚛",
		"S":"𝐒ЅՏᏕᏚꓢＳ𐊖𐐠ƽѕꜱꮪｓ𐑈",
		"T":"𝐓ΤτТтᎢᴛ⊤⟙ⲦꓔꭲＴ𐊗𐊱𐌕ｔ𝐭𝑡𝒕𝓉𝓽𝔱𝕥𝖙𝗍𝘁𝘵𝙩𝚝",
		"U":"𝐔Սሀᑌ∪⋃ꓴＵ𐓎ʋυսᴜꞟꭎꭒｕ𐓶",
		"V":"𝐕Ѵ٧۷ᏙᐯⅤⴸꓦꛟＶνѵטᴠⅴ∨⋁ꮩｖ",
		"W":"𝐖ԜᎳᏔꓪＷɯѡԝաᴡꮃｗ",
		"X":"𝐗ΧХ᙭ᚷⅩ╳ⲬⵝꓫꞳＸ𐊐𐊴𐌗𐌢×хᕁᕽ᙮ⅹ⤫⤬⨯ｘ𝐱𝑥𝒙𝓍𝔁𝔵𝕩𝖝𝗑𝘅𝘹𝙭𝚡",
		"Y":"𝐘ΥϒУҮᎩᎽⲨꓬＹ𐊲ɣʏγуүყᶌỿℽꭚｙ",
		"Z":"𝐙ΖᏃℤℨꓜＺᴢꮓｚ",
	}
	_table = {y:i for i, x in _transdict.items() for y in list(x)}
	trans_unicode = str.maketrans(_table)
	return string.translate(trans_unicode)
